<a href="https://colab.research.google.com/github/angelarwa/TIL/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 12월 17일

In [0]:
import pandas as pd
#dict 타입으로부터 DataFrame 생성
dict_data = {'c0': [1,2,3], 'c1': [4,5,6], 'c2': [7,8,9], 'c3': [10,11,12], 'c4': [13,14,15]}
df = pd.DataFrame(dict_data)
print(type(df))
print(df)
print(df.index) #행 인덱스
print(df.columns) #열이름

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15
RangeIndex(start=0, stop=3, step=1)
Index(['c0', 'c1', 'c2', 'c3', 'c4'], dtype='object')

In [0]:
# 데이터와 행인덱스, 열 이름을 지정해서 DataFrame 생성
df2 = pd.DataFrame([[25,'남' , '율도국'],[17, '여', '인당수']], index=['홍길동', '심청'], columns=['나이', '성별', '주소'])
print(type(df2))
print(df2)
print(df2.index)  #행 인덱스
print(df2.columns)  #열 이름
print(id(df2))

<class 'pandas.core.frame.DataFrame'>
     나이 성별   주소
홍길동  25  남  율도국
심청   17  여  인당수
Index(['홍길동', '심청'], dtype='object')
Index(['나이', '성별', '주소'], dtype='object')
2880383786120

In [0]:
df2.index =['주인공1', '주인공2']   #행 인덱스 변경 가능
df2.columns = ['age', 'gender', 'address']   #열 이름 변경 가능
print(df2)
print(df2.index)  #행 인덱스
print(df2.columns)  #열 이름
print(id(df2))

      age gender address
주인공1   25      남     율도국
주인공2   17      여     인당수
Index(['주인공1', '주인공2'], dtype='object')
Index(['age', 'gender', 'address'], dtype='object')
2880383786120

In [0]:
# IPython.display은 IPython 셸 환경에서 dataframe을 테이블 형식으로 표현합니다.
import pandas as pd
import numpy as np
from IPython.display import display
my_2darray = np.array([[1,2,3], [4,5,6]])
display(pd.DataFrame(my_2darray))

   0  1  2
0  1  2  3
1  4  5  6

In [0]:
dict_data = {'c0': [1,2,3], 'c1': [4,5,6], 'c2': [7,8,9], 'c3': [10,11,12], 'c4': [13,14,15]}
display( pd.DataFrame(dict_data))

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [0]:
df2 = pd.DataFrame([[25,'남' , '율도국'],[17, '여', '인당수']], index=['홍길동', '심청'], columns=['나이', '성별', '주소'])
display(df2)

     나이 성별   주소
홍길동  25  남  율도국
심청   17  여  인당수

In [0]:
exam_data= {'수학': [90,80,70],
                  '영어': [95,89,90],
                  '국어': [100,80,75],
                  '과학': [70,70,70]}
df = pd.DataFrame(exam_data, index=['영희', '철수', '삼식'])
print(df)

    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70
삼식  70  90   75  70

In [0]:
df2 = df[ : ]  # 새로운 DataFrame객체를 복제함
#print(id(df))
#print(id(df2))
result = df2.drop('삼식')  #행 인덱스(label)로 행 삭제한 새로운 데이터프레임 객체 생성 반환
print(df2)
print(result)

    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70
삼식  70  90   75  70
    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70

In [0]:
df2.drop('삼식', inplace=True)   #행 삭제한 새로운 데이터프레임 객체 반환대신 자기자신의 행 삭제
print(df2)

    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70

C:\Users\student\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [0]:
df2 = df[ : ]  # 새로운 DataFrame객체를 복제함
df2.drop('수학', axis=1,  inplace=True) 
print(df2)

    영어   국어  과학
영희  95  100  70
철수  89   80  70
삼식  90   75  70

In [0]:
#행 선택
student1 = df.loc['철수']   #label 을 사용해서 행을 선택
print(student1)
student2 = df.iloc[0]  #index 을 사용해서 행을 선택
print(student2)

수학    80
영어    89
국어    80
과학    70
Name: 철수, dtype: int64
수학     90
영어     95
국어    100
과학     70
Name: 영희, dtype: int64

In [0]:
students1 = df.loc[['철수', '삼식']]   #label 을 사용해서 2개 이상 행을 선택
print(students1)
students2 = df.iloc[[0,1]]  #index 을 사용해서 2개 이상 행을 선택
print(students2)

    수학  영어  국어  과학
철수  80  89  80  70
삼식  70  90  75  70
    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70

In [0]:
students3 = df.loc['철수' : '삼식']   #행 인덱스(labe) 범위 지정,  행 선택,  end label을 포함
print(students3)
students4 = df.iloc[0:2]  #행 인덱스 범위 지정,  행 선택 -  end index는 포함하지 않는다.
print(students4)

    수학  영어  국어  과학
철수  80  89  80  70
삼식  70  90  75  70
    수학  영어   국어  과학
영희  90  95  100  70
철수  80  89   80  70

In [0]:
###데이터프레임으로부터 열 선택
exam_data= {'이름' : ['영희', '철수', '삼식'],
                  '수학': [90,80,70],
                  '영어': [95,89,90],
                  '국어': [100,80,75],
                  '과학': [70,70,70]}
df = pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   국어  과학
0  영희  90  95  100  70
1  철수  80  89   80  70
2  삼식  70  90   75  70

In [0]:
print(df['수학'])
eng =df.영어
print(eng)
print(type(eng))   #Series 타입

0    90
1    80
2    70
Name: 수학, dtype: int64
0    95
1    89
2    90
Name: 영어, dtype: int64
<class 'pandas.core.series.Series'>

In [0]:
subjects = df[['수학', '국어']]
print(subjects)
print(type(subjects))    #DataFrame타입

   수학   국어
0  90  100
1  80   80
2  70   75
<class 'pandas.core.frame.DataFrame'>

In [0]:
df.set_index('이름', inplace=True)
print(df)

    수학  영어   국어  과학
이름
영희  90  95  100  70
철수  80  89   80  70
삼식  70  90   75  70

In [0]:
#철수의 수학, 과학 점수 선택 출력
a=df.loc['철수',['수학','과학']]
print(a)
b=df.iloc[1,[0,3]] #정수 인덱스 값으로 지정할때는 iloc
print(b)

수학    80
과학    70
Name: 철수, dtype: int64
수학    80
과학    70
Name: 철수, dtype: int64

In [0]:
exam_data= {'이름' : ['영희', '철수', '삼식'],
                  '수학': [90,80,70],
                  '영어': [95,89,90],
                  '국어': [100,80,75],
                  '과학': [70,70,70]}
df = pd.DataFrame(exam_data)
print(df)
#컬럼에 데이터 추가
df['과학'] = 95
print(df)

   이름  수학  영어   국어  과학
0  영희  90  95  100  70
1  철수  80  89   80  70
2  삼식  70  90   75  70
   이름  수학  영어   국어  과학
0  영희  90  95  100  95
1  철수  80  89   80  95
2  삼식  70  90   75  95

In [0]:
df.loc['철수',['수학','과학']]=50,50
print(df)

     이름    수학    영어     국어    과학
0    영희  90.0  95.0  100.0  95.0
1    철수  80.0  89.0   80.0  95.0
2    삼식  70.0  90.0   75.0  95.0
철수  NaN  50.0   NaN    NaN  50.0

In [0]:
exam_data= {'이름' : ['영희', '철수', '삼식'],
                  '수학': [90,80,70],
                  '영어': [95,89,90],
                  '국어': [100,80,75],
                  '과학': [70,70,70]}
df = pd.DataFrame(exam_data)
print(df) 
#데이터 프레임에서 전치를 수행하려면 메소드 활용
df = df.transpose()
print(df)

   이름  수학  영어   국어  과학
0  영희  90  95  100  70
1  철수  80  89   80  70
2  삼식  70  90   75  70
      0   1   2
이름   영희  철수  삼식
수학   90  80  70
영어   95  89  90
국어  100  80  75
과학   70  70  70

In [0]:
df = df.T   #데이터프레임 클래스의 속성 활용
print(df)

   이름  수학  영어   국어  과학
0  영희  90  95  100  70
1  철수  80  89   80  70
2  삼식  70  90   75  70

In [0]:
#데이터프레임+ 산술연산자+스칼라값
import seaborn as sns
titanic = sns.load_dataset('titanic')

df= titanic[ : , ['age', 'fare']]
print(df.head())
print(type(df))
addition = df+10
print(addition .head())
print(type(addition))

In [0]:
file_path='C:/Users/student/Desktop/datas/datas/read_csv_sample.csv'
df=pd.read_csv(file_path)
print(df)
print(type(df))
print(df.dtypes)

df2=pd.read_csv(file_path, header=None)
print(df2)
print(type(df2))

df3=pd.read_csv(file_path, index_col=None)
print(df3)
print(type(df3))

df4=pd.read_csv(file_path, index_col='c0')
print(df4)
print(type(df4))

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9
<class 'pandas.core.frame.DataFrame'>
c0    int64
c1    int64
c2    int64
c3    int64
dtype: object
    0   1   2   3
0  c0  c1  c2  c3
1   0   1   4   7
2   1   2   5   8
3   2   3   6   9
<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9
<class 'pandas.core.frame.DataFrame'>
    c1  c2  c3
c0
0    1   4   7
1    2   5   8
2    3   6   9
<class 'pandas.core.frame.DataFrame'>

In [0]:
file_path='C:/Users/student/Desktop/datas/datas/남북한발전전력량.xlsx'
df=pd.read_excel(file_path)
print(df)
print(type(df))
print(df.dtypes)

df1=pd.read_excel(file_path, header=None)
print(df1)
print(type(df1))

  전력량 (억㎾h) 발전 전력별  1990  1991  1992  1993  1994  1995  1996  1997  ...  2007  \
0        남한     합계  1077  1186  1310  1444  1650  1847  2055  2244  ...  4031
1       NaN     수력    64    51    49    60    41    55    52    54  ...    50
2       NaN     화력   484   573   696   803  1022  1122  1264  1420  ...  2551
3       NaN    원자력   529   563   565   581   587   670   739   771  ...  1429
4       NaN    신재생     -     -     -     -     -     -     -     -  ...     -
5        북한     합계   277   263   247   221   231   230   213   193  ...   236
6       NaN     수력   156   150   142   133   138   142   125   107  ...   133
7       NaN     화력   121   113   105    88    93    88    88    86  ...   103
8       NaN    원자력     -     -     -     -     -     -     -     -  ...     -

   2008  2009  2010  2011  2012  2013  2014  2015  2016
0  4224  4336  4747  4969  5096  5171  5220  5281  5404
1    56    56    65    78    77    84    78    58    66
2  2658  2802  3196  3343  3430  3581  3427  3402  3523
3  1510  1478  1486  1547  1503  1388  1564  1648  1620
4     -     -     -     -    86   118   151   173   195
5   255   235   237   211   215   221   216   190   239
6   141   125   134   132   135   139   130   100   128
7   114   110   103    79    80    82    86    90   111
8     -     -     -     -     -     -     -     -     -

[9 rows x 29 columns]
<class 'pandas.core.frame.DataFrame'>
전력량 (억㎾h)    object
발전 전력별       object
1990         object
1991         object
1992         object
1993         object
1994         object
1995         object
1996         object
1997         object
1998         object
1999         object
2000         object
2001         object
2002         object
2003         object
2004         object
2005         object
2006         object
2007         object
2008         object
2009         object
2010         object
2011         object
2012         object
2013         object
2014         object
2015         object
2016         object
dtype: object
          0       1     2     3     4     5     6     7     8     9   ...  \
0  전력량 (억㎾h)  발전 전력별  1990  1991  1992  1993  1994  1995  1996  1997  ...
1         남한      합계  1077  1186  1310  1444  1650  1847  2055  2244  ...
2        NaN      수력    64    51    49    60    41    55    52    54  ...
3        NaN      화력   484   573   696   803  1022  1122  1264  1420  ...
4        NaN     원자력   529   563   565   581   587   670   739   771  ...
5        NaN     신재생     -     -     -     -     -     -     -     -  ...
6         북한      합계   277   263   247   221   231   230   213   193  ...
7        NaN      수력   156   150   142   133   138   142   125   107  ...
8        NaN      화력   121   113   105    88    93    88    88    86  ...
9        NaN     원자력     -     -     -     -     -     -     -     -  ...

     19    20    21    22    23    24    25    26    27    28
0  2007  2008  2009  2010  2011  2012  2013  2014  2015  2016
1  4031  4224  4336  4747  4969  5096  5171  5220  5281  5404
2    50    56    56    65    78    77    84    78    58    66
3  2551  2658  2802  3196  3343  3430  3581  3427  3402  3523
4  1429  1510  1478  1486  1547  1503  1388  1564  1648  1620
5     -     -     -     -     -    86   118   151   173   195
6   236   255   235   237   211   215   221   216   190   239
7   133   141   125   134   132   135   139   130   100   128
8   103   114   110   103    79    80    82    86    90   111
9     -     -     -     -     -     -     -     -     -     -

[10 rows x 29 columns]
<class 'pandas.core.frame.DataFrame'>

In [0]:
#JSON형식의 파일 읽기
file_path='C:/Users/student/Desktop/datas/datas/sample.html'
df5=pd.read_json(file_path) 
print(df)
print(df.index)
print(df.columns)

ValueError: Expected object or value

In [0]:
#HTML형식의 파일로부터 테이블 읽기
file_path='C:/Users/student/Desktop/datas/datas/sample.html'
tables=pd.read_html(file_path) 
print(len(tables))
 
for i in range(len(tables)):
   print("tables[%s]" % i)
   print(tables[i])

df = tables[1]
print(df)
df.set_index(['name'] , inplace=True)
print(df)

2
tables[0]
   Unnamed: 0  c0  c1  c2  c3
0           0   0   1   4   7
1           1   1   2   5   8
2           2   2   3   6   9
tables[1]
         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True
         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True
            year        developer  opensource
name
NumPy       2006  Travis Oliphant        True
matplotlib  2003   John D. Hunter        True
pandas      2008    Wes Mckinneye        True

In [0]:
#CSV파일로 저장
exam_data= {'이름' : ['영희', '철수', '삼식'],
                  '수학': [90,80,70],
                  '영어': [95,89,90],
                  '국어': [100,80,75],
                  '과학': [70,70,70]}
df = pd.DataFrame(exam_data)
df.set_index('이름', inplace=True)
print(df)
df.to_csv("C:/Users/student/Desktop/datas/output/exam_sample.csv")

#JSON파일로 저장
df.to_json("C:/Users/student/Desktop/datas/output/exam_sample.json")


#excel파일로 저장
df.to_excel("C:/Users/student/Desktop/datas/output/exam_sample.xlsx")

    수학  영어   국어  과학
이름
영희  90  95  100  70
철수  80  89   80  70
삼식  70  90   75  70

In [0]:
dict_data = {'c0': [1,2,3], 'c1': [4,5,6], 'c2': [7,8,9], 'c3': [10,11,12], 'c4': [13,14,15]}
df2 = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df2)

writer=pd.ExcelWriter("C:/Users/student/Desktop/datas/output/df_excelwriter.xlsx")
df.to_excel(writer, sheet_name="sheet1")
df2.to_excel(writer, sheet_name="sheet2")
writer.save()

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [0]:
#데이터 프레임에 함수 적용
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame
np.abs(frame)   #numpy의 유니버셜 함수를 데이터프레임 객체에 적용 가능

               b         d         e
Utah    2.138152  0.881433  1.124129
Ohio    0.345682  0.004419  1.680416
Texas   0.184103  0.508132  0.621896
Oregon  0.509252  1.270235  0.658392